practice_004.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Practice #004</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="style.css">

</head>
<body>
<!--  --><nav><span class="nav-header">Problem Solving</span><span class="nav-items"><a href="index.html">Home</a><span></nav><div id="content" class="content">
<h1 class="title">Practice #004</h1>
<ul class="org-ul">
<li>Time Spent: 20 minutes 30 seconds</li>
<li>Time Allotted: 1 hour</li>
<li>Completed: July 2, 2022 4:43 PM</li>
</ul>

<div id="outline-container-orgfb0277d" class="outline-2">
<h2 id="orgfb0277d"><a href="leetcode_344_reverse_string.html#ID-0DBDF1EF-68D9-48E7-AF96-A4B1F7BB53DF">Leetcode: 344. Reverse String</a></h2>
<div class="outline-text-2" id="text-orgfb0277d">
<ul class="org-ul">
<li>Not much, since this is an elementary problem.</li>
</ul>
</div>
</div>

<div id="outline-container-orgfa497ee" class="outline-2">
<h2 id="orgfa497ee"><a href="leetcode_1504_count_submatrices_with_all_ones.html#ID-3E6C3C54-F5AD-44FE-8BDE-AC52E0D3A01E">Leetcode: 1504. Count Submatrices With All Ones</a></h2>
<div class="outline-text-2" id="text-orgfa497ee">
<ul class="org-ul">
<li>Retrospective
<ul class="org-ul">
<li>Pros
<ul class="org-ul">
<li>Found solution by first guessing the complexity (\(O(n^2 \times m^2)\) won't pass, \(O(n \times m^2)\) would pass) and then translating it back to the problem (e.g. I would have to fix the bottom of the rectangle and iterate over the its sides).</li>
</ul></li>
<li>Cons
<ul class="org-ul">
<li>Did not follow the method to see if I could find a \(O(n \times m)\) solution.</li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
</div>
</body>
</html>